from functions import *


if __name__ == '__main__':
    # p = int(input('Введите значение p : '))
    # e = int(input("Введите значение максимально допустимой среднеквадратической ошибки e : "))
    # a = int(input("Введите значени максимально допустимого шага обучения a : "))
    # N = int(inout('Введите число итераций обучения N : '))
    # n = int(input('Введите желамемое количество прогнозируемых значений n :'))

    print('Введите номер функции генерации последовательности: ')
    print('1 - последовательность чисел Фибоначчи')
    print('2 - факториальная функция')
    print('3 - степенная функция')
    print('4 - периодическая функция')
    choice = int(input())
    if choice == 1:
        #         k, p,     e,   a,   N,  n
        nn_result(8, 3, 0.05, 0.001, 100, 3, 1)
    elif choice == 2:
        #         k, p,     e,   a,   N,  n
        nn_result(5, 2, 0.0001, 0.001, 100, 3, 2)
    elif choice == 3:
        #         k, p,     e,   a,   N,  n
        nn_result(5,2,0.01,0.001,100,3,3)
    elif choice == 4:
        #         k, p,     e,   a,   N,  n
        nn_result(5,2,0.05,0.001,100,3,4)
    else:
        print('Данные введены неверно')
